{
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "Accountant",
    "1": "Advocate",
    "2": "Agriculture",
    "3": "Apparel",
    "4": "Architecture",
    "5": "Arts",
    "6": "Automobile",
    "7": "Aviation",
    "8": "BPO",
    "9": "Banking",
    "10": "Blockchain",
    "11": "Building and Construction",
    "12": "Business Analyst",
    "13": "Civil Engineer",
    "14": "Consultant",
    "15": "Data Science",
    "16": "Database",
    "17": "Designing",
    "18": "DevOps",
    "19": "Digital Media",
    "20": "DotNet Developer",
    "21": "ETL Developer",
    "22": "Education",
    "23": "Electrical Engineering",
    "24": "Finance",
    "25": "Food and Beverages",
    "26": "Health and Fitness",
    "27": "Human Resources",
    "28": "Information Technology",
    "29": "Java Developer",
    "30": "Management",
    "31": "Mechanical Engineer",
    "32": "Network Security Engineer",
    "33": "Operations Manager",
    "34": "PMO",
    "35": "Public Relations",
    "36": "Python Developer",
    "37": "React Developer",
    "38": "SAP Developer",
    "39": "SQL Developer",
    "40": "Sales",
    "41": "Testing",
    "42": "Web Designing"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Accountant": 0,
    "Advocate": 1,
    "Agriculture": 2,
    "Apparel": 3,
    "Architecture": 4,
    "Arts": 5,
    "Automobile": 6,
    "Aviation": 7,
    "BPO": 8,
    "Banking": 9,
    "Blockchain": 10,
    "Building and Construction": 11,
    "Business Analyst": 12,
    "Civil Engineer": 13,
    "Consultant": 14,
    "Data Science": 15,
    "Database": 16,
    "Designing": 17,
    "DevOps": 18,
    "Digital Media": 19,
    "DotNet Developer": 20,
    "ETL Developer": 21,
    "Education": 22,
    "Electrical Engineering": 23,
    "Finance": 24,
    "Food and Beverages": 25,
    "Health and Fitness": 26,
    "Human Resources": 27,
    "Information Technology": 28,
    "Java Developer": 29,
    "Management": 30,
    "Mechanical Engineer": 31,
    "Network Security Engineer": 32,
    "Operations Manager": 33,
    "PMO": 34,
    "Public Relations": 35,
    "Python Developer": 36,
    "React Developer": 37,
    "SAP Developer": 38,
    "SQL Developer": 39,
    "Sales": 40,
    "Testing": 41,
    "Web Designing": 42
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.52.4",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
